project-codeigniter-4/app/Models/ComicsModel.php

SELECT *
FROM `comics`
---
    public function getComics($slug = false)
    {
        if($slug == false) {
            return $this->findAll();