project-codeigniter-4/app/Controllers/Comics.php

    public function save()
    {
        // Validasi Input
        if (!$this->validate([
            'judul' => 'required|is_unique[comics.judul]'
        ])) {
            $validation = \Config\Services::validation();
            // dd($validation);
            return redirect()->to('/comics/create')->withInput()->with('validation', $validation);
        }

        $slug = url_title($this->request->getVar('judul'), '-', true);
        $this->comicsModel->save([
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'sampul' => $this->request->getVar('sampul')
        ]);
---
INSERT INTO `comics` (`judul`, `slug`, `penulis`, `penerbit`, `sampul`, `created_at`, `updated_at`) VALUES ('', '', '', '', '', '2023-09-07 10:21:38', '2023-09-07 10:21:38')